# How do I remove columns from a pandas DataFrame?

In [45]:
import pandas as pd

In [73]:
url = 'http://bit.ly/uforeports'
ufo = pd.read_csv(url)
print(ufo.shape) # shows number of rows and columns
ufo.head()

(18241, 5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [74]:
# Method 1
ufo.drop(columns='Colors Reported', inplace=True) # inplace to apply the changes to this DataFrame
print(ufo.shape)
ufo.head()

(18241, 4)

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

To try a different method in the same column we would need to first reestablish the DataFrame to the original form. We'd have to read it again to reassign the variable: ufo = pd.read_csv(url).

In [75]:
# Method 2
ufo.drop('Shape Reported', axis=1, inplace=True) # axis=1 to search the label in the columns (axis=0 by default)
print(ufo.shape)
ufo.head()

(18241, 3)

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

In [77]:
# Method 3
ufo.drop(['City', 'State'], axis=1, inplace=True) # to remove more than one column we enter a list
print(ufo.shape)
ufo.head()

(18241, 1)

              Time
0   6/1/1930 22:00
1  6/30/1930 20:00
2  2/15/1931 14:00
3   6/1/1931 13:00
4  4/18/1933 19:00

## Removing rows

In [78]:
# Method 1
ufo.drop([0, 1], inplace=True) # to remove a row we don't have to specify it because the default parameter is axis=0
print(ufo.shape)
ufo.head()

(18239, 1)

              Time
2  2/15/1931 14:00
3   6/1/1931 13:00
4  4/18/1933 19:00
5  9/15/1934 15:30
6   6/15/1935 0:00